using System;

class Drinks
{
    static void Main(string[] args)
    {
        //четене на входа
        long total = long.Parse(Console.ReadLine());
        // бройката е с единица повече за да мога директно да си вземам индекса при изчисленията (1)
        bool[] pass = new bool[total + 1]; // pass е от passengers
        // четене на хората, които ще пият чай
        long n = long.Parse(Console.ReadLine());
        for (int i = 0; i < n; i++)
        {
            long k = long.Parse(Console.ReadLine());
            pass[k] = true;
        }

        // махнете коментара на реда по-долу и изтрийте следващия и ще видите 5 time limit-a в BgCoder//
        // BigInteger time = 0;
        long time = 0; // ето този ред 2 дена ми отне
        // брояч на хората пиещи чай
        long TT = 0;
        //брояч на хората пиещи кафе
        long CC = 0;
        // брояч на необходимите зареждания на машината
        long machines = 0;
        // оказва се че е по-кратко нашата мила стюардеса да започне отзад напред, защото ако бройката не се дели на 7
        // тя да се разходи до по-близките до нея хора, т.е. първите номера, а не до последните

        //(1) затова цикъла тук е до 1
        for (long i = total; i >= 1; i--)
        {
            // проверка за това дали 7 човека подред пият кафе : ако ДА добавям удвоеното време /отиване и връщане/ на
            // човека с най-висок номер и сменям брояча с 6 в цикъла се сменя с още 1 да стане общо 7 и увеличавам броя "кафе/чай-варки" с 1
            // за да не изляза от масива искам i да е по голямо от 20 /примерно/
            if ((i - 20) > 0 && !pass[i] && !pass[i - 1] && !pass[i - 2] && !pass[i - 3] && !pass[i - 4] && !pass[i - 5] && !pass[i - 6])
            {
                time += 2 * i;
                machines++;
                i -= 6;
            }
            // ако горното условие не е вярно значи в тези 7 човека някой пие чай тогава ги обхождам последователно всеки 1 по 1
            else
            {
                while (true)
                {
                    if (pass[i])
                    {
                        // ако пие чай увеличавам бройката на пиещите чай с единица
                        TT++;
                        // тази проверка показва, че е започната "нова кана" или трябва стюардесата да се върне да я напълни за 7 човека
                        if (TT % 7 == 1)
                        {
                            time += 2 * i;
                            machines++;
                        }
                        // вадя единица от брояча този човек съм го преброил
                        i--;
                    }
                    else
                    {
                        // ако пие кафе увеличавам бройката на пиещите кафе с единица
                        CC++;
                        // тази проверка показва, че е започната "нова кана" или трябва стюардесата да се върне да я напълни за 7 човека
                        if (CC % 7 == 1)
                        {
                            time += 2 * i;
                            machines++;
                        }
                        // вадя единица от брояча този човек съм го преброил
                        i--;
                        // понеже е по-бързо да проверявам по 7 човека наведнъж искам да изляза от този цикъл когато стюардесата е
                        // наляла кафе на кратно на 7 човека
                        if (CC % 7 == 0)
                        {
                            // корекция за брояча във for цикъла
                            i++;
                            break;
                        }
                    }
                    // е за да не изляза от масива трябва да спра цикъла ако i = 0
                    if (i == 0)
                    {
                        break;
                    }
                }
            }
        }
        // времето за наливане на напитка е фиксирано и просто го добавям, няма значение последователността за всеки по 4 сек
        time += 4 * total;
        // времето за пълнене на каната е фиксирано и просто го добавям, няма значение последователността за всяка по 47 сек
        time += 47 * machines;
        Console.WriteLine(time);
    }
}